package LessoN1;

//Модифікатор доступу + слово interface + назва інтерфейсу
//Слово void - означає, що метод не повертає жодного значення після виконання.
// Він просто виконує певну дію — у цьому випадку виводить інформацію про книгу в консоль.
//назва методу
public interface Book {
    void displayInfo(); // Відображає інформацію про книгу

    String getTitle();  // Повертає назву книги

    String getAuthor(); // Повертає ім'я автора

    int getPageCount(); // Повертає кількість сторінок (якщо це можливо для eBook)

    void open();        // Відкриває книгу для читання

    void close();       // Закриває книгу

    boolean isDownloaded(); // Перевіряє, чи завантажена книга
}
